config = {
    "凝夜白霜": ["暴击率", "攻击力百分比", "共鸣效率", "暴击伤害", "冷凝伤害加成"],
    "熔山裂谷": ["暴击率", "攻击力百分比", "共鸣效率", "暴击伤害", "热熔伤害加成"],
    "彻空冥雷": ["暴击率", "攻击力百分比", "共鸣效率", "暴击伤害", "导电伤害加成"],
    "啸谷长风": ["暴击率", "攻击力百分比", "共鸣效率", "暴击伤害", "气动伤害加成"],
    "浮星祛暗": ["暴击率", "攻击力百分比", "共鸣效率", "暴击伤害", "衍射伤害加成"],
    "沉日劫明": ["暴击率", "攻击力百分比", "共鸣效率", "暴击伤害", "湮灭伤害加成"],
    "隐世回光": ["暴击率", "生命百分比", "治疗效果加成", "攻击力百分比", "共鸣效率", "暴击伤害", "冷凝伤害加成", "热熔伤害加成", "导电伤害加成", "气动伤害加成", "湮灭伤害加成", "湮灭伤害加成"],
    "轻云出月": ["暴击率", "攻击力百分比", "共鸣效率", "暴击伤害", "冷凝伤害加成", "热熔伤害加成", "导电伤害加成", "气动伤害加成", "湮灭伤害加成", "湮灭伤害加成"],
    "不绝余音": [],
    "凌冽决断之心": ["暴击率", "攻击力百分比", "共鸣效率", "暴击伤害", "冷凝伤害加成"],
    "此间永驻之光": ["暴击率", "攻击力百分比", "共鸣效率", "暴击伤害", "衍射伤害加成"],
    "幽夜隐匿之帷": ["暴击率", "攻击力百分比", "共鸣效率", "暴击伤害", "湮灭伤害加成"],
    "高天共奏之曲": ["暴击率", "攻击力百分比", "共鸣效率", "暴击伤害", "冷凝伤害加成", "热熔伤害加成", "导电伤害加成", "气动伤害加成", "湮灭伤害加成", "湮灭伤害加成"],
    "无惧浪涛之勇": ["暴击率", "攻击力百分比", "共鸣效率", "暴击伤害", "冷凝伤害加成", "热熔伤害加成", "导电伤害加成", "气动伤害加成", "湮灭伤害加成", "湮灭伤害加成"]
}