config = {
    "凝夜冰霜": {
        'COST 4': ["暴击率", "暴击伤害"],
        'COST 3': ["攻击力百分比", "共鸣效率", "冷凝伤害加成"],
        'COST 1': ["攻击力百分比"]
    },
    "熔山裂谷": {
        'COST 4': ["暴击率", "暴击伤害"],
        'COST 3': ["攻击力百分比", "共鸣效率", "热熔伤害加成"],
        'COST 1': ["攻击力百分比"]
    },
    "彻空冥雷": {
        'COST 4': ["暴击率", "暴击伤害"],
        'COST 3': ["攻击力百分比", "共鸣效率", "导电伤害加成"],
        'COST 1': ["攻击力百分比"]
    },
    "啸谷长风": {
        'COST 4': ["暴击率", "暴击伤害"],
        'COST 3': ["攻击力百分比", "共鸣效率", "气动伤害加成"],
        'COST 1': ["攻击力百分比"]
    },
    "浮星祛暗": {
        'COST 4': ["暴击率", "暴击伤害"],
        'COST 3': ["攻击力百分比", "共鸣效率", "衍射伤害加成"],
        'COST 1': ["攻击力百分比"]
    },
    "沉日劫明": {
        'COST 4': ["暴击率", "暴击伤害"],
        'COST 3': ["攻击力百分比", "共鸣效率", "湮灭伤害加成"],
        'COST 1': ["攻击力百分比"]
    },
    "隐世回光": {
        'COST 4': ["暴击率", "暴击伤害", "治疗效果加成"],
        'COST 3': ["攻击力百分比", "共鸣效率", "冷凝伤害加成", "热熔伤害加成", "导电伤害加成", "气动伤害加成", "湮灭伤害加成", "衍射伤害加成"],
        'COST 1': ["攻击力百分比", "生命值百分比"]
    },
    "轻云出月": {
        'COST 4': ["暴击率", "暴击伤害"],
        'COST 3': ["攻击力百分比", "共鸣效率", "冷凝伤害加成", "热熔伤害加成", "导电伤害加成", "气动伤害加成", "湮灭伤害加成", "衍射伤害加成"],
        'COST 1': ["攻击力百分比"]
    },
    "不绝余音": {
        'COST 4': [],
        'COST 3': [],
        'COST 1': []
    },
    "凌冽决断之心": {
        'COST 4': ["暴击率", "暴击伤害"],
        'COST 3': ["攻击力百分比", "共鸣效率", "冷凝伤害加成"],
        'COST 1': ["攻击力百分比"]
    },
    "此间永驻之光": {
        'COST 4': ["暴击率", "暴击伤害"],
        'COST 3': ["攻击力百分比", "共鸣效率", "衍射伤害加成"],
        'COST 1': ["攻击力百分比"]
    },
    "幽夜隐匿之帷": {
        'COST 4': ["暴击率", "暴击伤害"],
        'COST 3': ["攻击力百分比", "共鸣效率", "湮灭伤害加成"],
        'COST 1': ["攻击力百分比"]
    },
    "高天共奏之曲": {
        'COST 4': ["暴击率", "暴击伤害"],
        'COST 3': ["攻击力百分比", "共鸣效率", "冷凝伤害加成", "热熔伤害加成", "导电伤害加成", "气动伤害加成", "湮灭伤害加成", "衍射伤害加成"],
        'COST 1': ["攻击力百分比"]
    },
    "无惧浪涛之勇": {
        'COST 4': ["暴击率", "暴击伤害"],
        'COST 3': ["攻击力百分比", "共鸣效率", "冷凝伤害加成", "热熔伤害加成", "导电伤害加成", "气动伤害加成", "湮灭伤害加成", "衍射伤害加成"],
        'COST 1': ["攻击力百分比"]
    }
}

ignore_handled = True